title: Tracing process heiarchy 
id: 76678788-032f-48c4-89d4-29a36ada7b1b
author: Steven Lourenco 20stevenl02@gmail.com
date: 2026-01-28
description: creates a tree like veiw of the heiarchy of process ranging from parent process to great grand child (4 levels) to assist with threat hunting and triaging malicous processes
usage instructions: 
- utilize as as splunk macro with $host$ arg 
- keep time range to a minimum
- use specficic process names to filter results
log_source:
  platform: splunk
  product: windows
  category: process_creation
data_sources: windows_sysmon
query:
  language: spl
  text:
  sourcetype=Sysmon:Operational EventCode=1 host=$host$
  | rename ProcessId as pid1, ParentProcessId as ppid1, Image as image1, CommandLine as cmd1
  | table _time host pid1 ppid1 image1 cmd1
  | eval join_key=pid1
  | join type=left join_key [
    search source="WinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1 host=$host$
    | rename ProcessId as pid2, ParentProcessId as ppid2, Image as image2, CommandLine as cmd2
    | eval join_key=ppid2
    | table join_key pid2 ppid2 image2 cmd2
  ]
  | eval join_key=pid2
  | join type=left join_key [
    search source="WinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1 host=$host$
    | rename ProcessId as pid3, ParentProcessId as ppid3, Image as image3, CommandLine as cmd3
    | eval join_key=ppid3
    | table join_key pid3 ppid3 image3 cmd3
  ]
  | eval join_key=pid3
  | join type=left join_key [
    search source="WinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1 host=$host$
    | rename ProcessId as pid4, ParentProcessId as ppid4, Image as image4, CommandLine as cmd4
    | eval join_key=ppid4
    | table join_key pid4 ppid4 image4 cmd4
  ]
  | eval tree_level1= image1 . " [" . cmd1 . "]"
  | eval tree_level2=if(isnotnull(image2),   image2 . " [" . cmd2 . "]", null())
  | eval tree_level3=if(isnotnull(image3),   image3 . " [" . cmd3 . "]", null())
  | eval tree_level4=if(isnotnull(image4),   image4 . " [" . cmd4 . "]", null())
  | eval full_tree = image1
    . (if(isnotnull(image2), "
    |---" . image2,""))
    . (if(isnotnull(image3), "
      |---" . image3,""))
    . (if(isnotnull(image4), "
          |---" . image4,""))
  | table _time host full_tree tree_level1 tree_level2 tree_level3 tree_level4
  | rename tree_level1 AS "Parent" tree_level2 AS "Child" tree_level3 AS "GrandChild" tree_level4 AS "GreatGrandChild"
